<?php

/*<name>*/
/***********************接口介绍说明******************************************
 * appen    接口文件名称
 * appname  使用名称
 * sen      参数数量
 * info     介绍
 * seng     擦拭名称
 * lei      是否系统接口
 * <appen>internet.in</appen>  
 * <appname>网络验证</appname> 
 * <sen>0<sen/>                
 * <seng1>参数=>接收内容</seng>
 * <lei>ok</lei>               
 * <info>接口公共接口,验证与服务器网络是否已经连接上,连接上返回1</info> 
 * *****************************************************************************
 */
/*</name>*/

PrInfo('1');
?>