<?php


/**
 * @操作信息
 * 
 * 
 */
 
     
     /**
      * @appen接收提示信息
      * appen 输出提示
      */
      return array(
      5000=>'无法接收到GET数据包',
      5001=>'无法接收到POST数据包',
      5002=>'数据包内出现系统屏蔽字符串',
      5003=>'数据包已经过期,拒绝接收',
      5004=>'接口不存在,连接失败',
      5005=>'软件连接号错误,访问软件不存在',
      5006=>'软件MD5验证失败',
      5007=>'非法的请求,身份验证失败!',
      5008=>'欢迎你首次使用!,请重新登陆.',
      5009=>'绑定特征码,已经有人绑定过了,不能重复绑定,不能登陆',
      5010=>'当前绑定特征已经有人绑定了',
      5011=>'账号注册成功,当前机器特征已经有人绑定',
      5012=>'当前特征已经有人绑定,无法在绑定',
      5013=>'绑定成功!',
      5014=>'绑定失败,请重试!',
      5015=>'绑定特征不能为空',
      5016=>'已经绑定了,不需要在绑定',
      5017=>'使用软件不属于账号登陆限时/计点模式',
      5018=>'当前卡串已经到期,无法解除绑定',
      5019=>'解除绑定将到期,无法解除绑定',
      5020=>'解除绑定失败,请重试或者联系相关人员解决',
      5021=>'解除绑定成功,已经扣除对应时间',
      5022=>'当前的卡串已经解除绑定,无须在解除绑定,请直接绑定就可以',
      5023=>'绑定KEY不能为空',
      5024=>'绑定成功!',
      5025=>'绑定失败,当前卡串已经绑定key,必须解除绑定才能在绑定',
      5026=>'账号登录超时,由于你长时间没有操作请种新登录',
      5027=>'登录状态更新失败！',
      5028=>'登录状态更新成功！',
      5029=>'帐号没有到期！',
      5030=>'登录帐号已经到期！',
      5031=>'执行正常',
      5032=>'扣点模式之扣点执行失败',
      5033=>'用户已经到期,无法获取重要的验证数据',
      5034=>'非绑定机器,如不需要验证绑定特征请设置',
      5035=>'非绑定机器,请到绑定机器上使用',
	  5036=>'执行正常,当前扣点模式为：客户端扣点API调用被动',
	  5037=>'登录模式计点模式扣点执行正常',
	  5038=>'登录模式计点模式扣点执行失败',
	  5039=>'扣点点数不能小于或者等于0',
      5040=>'模式不匹配,当前API只能在《登录计时模式》下使用',
      5041=>'软件非扣点模式,API无法执行',
	  5042=>'使用软件不属于卡串计时/扣点模式',
      5043=>'模式不匹配,当前API只能在《卡串计时模式》下使用',
	  5044=>'点数不足,无法扣除！',
	  5045=>'模式不匹配,当前API只能在《登录扣点模式》下使用',
	  5046=>'模式不匹配,当前API只能在《卡串扣点模式》下使用',
      5047=>'登录限制验证通过,登录继续！',
      5048=>'当前机器登录量已经到达上限',
      5049=>'机器登录量已经达到上限',
      5050=>'账号多次登录使用已经达到上限！',
      5051=>'机器标记没有不可空 CODE:63782',
      
      );
      
      
 
      
?>