<?php


/**
 * @操作信息
 * 
 * 
 */
 
 
 
   /**
   * @错误信息
   * 所有会员操作函数所提示的信息
   * 提示从 1000开始
   */
	return array(
     1000 => '用户已经存在。请选择其他!',
     1001 => '你选择用户名可以使用!',
     1002 => '2次密码输入不一致!',
     1003 => '账号长度错误限制 '.(int)bs_lib::get_configs_value('user','user_a').'-'.(int)bs_lib::get_configs_value('user','user_b').'位数',
     1004 =>  bs_lib::get_configs_value('user','user_id_info'),
     1005 => '恭喜你注册成功!',
     1006 => '账号注册失败,你要注册账号可能被抢注了.',
     1007 => '密码长度限制 '.(int)bs_lib::get_configs_value('user','user_pwd_a').'-'.(int)bs_lib::get_configs_value('user','user_pwd_b').'位数',
     1008 => '账号错误',
     1009 => '密码错误',
     1010 => '登陆账号不存在',
     1011 => '登陆成功',
     1012 => '密码错误',
     1013 => '登陆失败',
     1014 => 'QQ号错误',
     1015 => '邮箱错误',
     1016 => '手机号码错误',
     1017 => '保存成功',
     1018 => '保存失败',
     1019 => '不能输入空格',
     1020 => '请输入密保问题或者答案',
     1021 => '账号已经被冻结禁止登陆',
     1022 => '记录查询失败',
     1023 => '你的密保信息已经填写',
     1024 => '密保信息添加成功',
     1025 => '密保添加失败',
     1026 => '密码不能包含空格',
     1027 => '请输入旧密码',
     1028 => '旧密码不能和新密码一致',
     1029 => '密码修改失败',
     1030 => '旧密码不正确,请重新输入',
     1031 => '密码修改成功',
     1032 => '表单信息不能为空,请返回填写',
     1033 => '密码已经成功通过密保信息修改',
     1034 => '密保信息错误',
     1035 => '密码找回失败',
     1036 => '验证码不能为空',
     1037 => '验证码正确',
     1038 => '验证码错误',
     1039 => '检测账号不能为空',
     1040 => '账号不能包含空格',
     1041 => '长时空闲超时执行正常',
     1042 => '长时空闲超时执行异常',
     1043 => '账号不存在',
     1044 => '账号已经被冻结禁止登陆',
     1045 => '登陆超时,由于你长时间不停留请重新登陆',
     1046 => '你在别处已经登陆,被迫登出！',
     1047 => '已经登陆',
     1048 => '你需要登陆才可以访问',
     1049 => '没有登录或登录已超时请登陆,在继续你的操作！',
     1050 => '密保不能少于4字符',
     1051 => '密保信息未填写',
     1052 => '充值账号不能为空',
     1053 => '充值卡号不能为空',
     1054 => '充值卡密码不能为空',
     1055 => '充值账号不能包含空格',
     1056 => '充值卡号不能包含空格',
     1057 => '充值卡密码不能包含空格',
     1058 => '充值卡号或充值卡密码错误',
     1059 => '充值的用户账号不存在',
     1060 => '充值卡账号密码错误或者不存在',
     1061 => '用户没有使用过要充值软件,拒绝充值',
     1062 => '激活成功,赶快去使用吧!',
     1063 => '充值失败!',
     1064 => '充值卡已经充值过了',
     1065 => '你留言和反馈我们已经收到,谢谢你的支持',
     1066 => '提交留言失败',
     1067 => '请输入标题',
     1068 => '请输入留言内容',
     1069 => '激活成功,请在次验证就可以使用了！',
     1070 => '添加失败',
     1071 => '糟糕卡串已经存在了',
     1072 => '还没有存在',
     1073 => '激活码不存在',
     1074 => '你使用激活串已到期作废！',
     1075 => '卡串已经存在,无法激活',
     1076 => 'car执行错误',
     1077 => '请检查卡串号或者密码错误！',
     1078 => '你使用权已经被冻结,无法验证！',
     1079 => '验证失败请确认已经输入卡串/或已经验证使用',
     1080 => '验证成功',
     1081 => '登录验证成功！',
     1082 => '你的使用期已到,请购卡在使用',
     1083 => '没有查询到用户信息',
     1084 => '该用户不是使用本软件的',
     1085 => '用户已经被冻结',
     1086 => '卡串或者验证串已经被冻结,无法继续。',
     1087 => '帐号已经到期请充值在使用。',
     1088 => '请输入一个邮箱作为你的帐号',  
     1089 => '恭喜你注册成功,赶快去你邮箱把你帐号激活吧!',
     1090 => '密保邮箱不能为空!',
     1091 => '密保邮箱格式不正确,请重新输入!',
     1092 => 'QQ号不能为空!',
     1093 => 'QQ号格式输入不正确,请重新输入!',
     1094 => '你的帐号还没激活,现在已经有一封激活邮件发到你注册邮箱上,赶快去激活吧！!',
     1095 => '请输入你联系访方式 QQ:1234556 邮箱:XXX@qq.com 电话:15288888888!',
     1096 => '账号余额不足,无法继续。',
     1097 => '账号余额不足,请充值在继续。',
     1098 => '执行扣点成功。',
     1099 => '执行扣点失败。',
     1100 => '扣除金额不能为零或小于零。',
     1101 => '记录日志标题不可为空。',
     1101 => '账号扣点为Bsphp验证商业功能才扣除,需要使用请选开启VIP用户权限 地址:http://management.bsphp.com',
	 1102 => '尊敬用户你非Bsphp商业用户你用户数已经达最大限制,如果你要继续让更都用户使用注册请先开通商业用户资格 地址:http://management.bsphp.com',
     1103 => '账号格式错误,只能选择中+下滑线',
     1104 => '账号格式错误,只能选择字母+数字和_下滑线',
     1105 => '当前账号包含禁止关键字,请更换其他！',
     1106 => '手机号码不能为空,请输入手机号码！',
     1107 => '账号注册成功,账号需要等待管理员审核才可正常使用！',
     1108 => '账号注册成功,账号需要等待验证邮件才能使用,请进入你邮箱验证注册！',
     1109 => '找回的账号错误,请正确输入需要找回账号！',
     1110 => '系统已经关闭账号注册,暂时无法注册！',
     1111 =>'注册账号过于频繁请稍后在试',
     1112 =>'充值失败,当前充值卡只可以充值已经到期账号,谢谢你使用,请到期后在充值',
     1113 =>'当前卡串不属于当前软件使用,请选择对应软件使用！',
     1114 =>'模式不符合,请选择对应软件使用！',
     
     1115 =>'卡串不能为空！',
     1116 =>'注销成功!',
     1117 =>'注销失败!',
     1118 =>'代理商账号只可以登录代理平台!',
     1119 =>'接口调用失败,非指定模式不可调用',
     1120 =>'当前账号禁止修改密码',
     1121 =>'用户关联账户不存在',
     1122 =>'激活成功',
     
     
     );
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
?>