<?php
	/*
'**************************************************************************************************
' 软件名称: 彩虹网络验证系统 Www.BsPhp.Com

' 官方网站: http://Www.BsPhp.Com
' 官方论坛：http://bbs.qicaihong.cc
' 版权所有: 七彩虹工作室   bu:小周
' 郑重声明:
'    1、任何个人或组织不得在未经授权的情况下删除、修改、拷贝本软件及其他副本上一切关于版权的信息；
'    2、作者保留此软件的法律追究权利
'**************************************************************************************************
*/


if(isset($_SERVER['HTTP_REFERER']))$uplink = $_SERVER['HTTP_REFERER'];

if($_GET['url']!='')  $uplink=$_GET['url'];


?>