<?php



	/**
	 * @软件发包接收文件
     * 
     * 下面文件只做初始化一些需要的数据
     * 
     * 运作流程初始化后会自己载入一些功能模块 模块路径include/lib 目录下文件
     * 
     * 功能块默认文件开头为 AppEn.        结尾以.php结尾
     * 
     * 中间关键字为模式关键字  文件名: AppEn.功能关键字.模式关键字.php
     * 
     * 
     * 
     *                 /接收到公共参数/
     * 
     * date=发包时间     1.
     * api=调用接口名称  2.
     * daihao=应用出现   3.
     * md5=程序MD5       4.
     * 软件开关检测      5.
     * 
     * 
	 */


//-----------------------------------------------------------------------------------------------
     // 入口字段
     const BSPHP_SET     =   'APPEN';
     require ('LibBsphp/Global.Bsphp.Inc.php');
 
//-----------------------------------------------------------------------------------------------
?>