<?php

/* *
* 功能：支付宝服务器异步通知页面
* 版本：3.3
* 日期：2012-07-23
* 说明：
* 以下代码只是为了方便商户测试而提供的样例代码，商户可以根据自己网站的需要，按照技术文档编写,并非一定要使用该代码。
* 该代码仅供学习和研究支付宝接口使用，只是提供一个参考。


*************************页面功能说明*************************
* 创建该页面文件时，请留心该页面文件中无任何HTML代码及空格。
* 该页面不能在本机电脑测试，请到服务器上做测试。请确保外部可以访问该页面。
* 该页面调试工具请使用写文本函数logResult，该函数已被默认关闭，见alipay_notify_class.php中的函数verifyNotify
* 如果没有收到该页面返回的 success 信息，支付宝会在24小时内按一定的时间策略重发通知

* 如何判断该笔交易是通过即时到帐方式付款还是通过担保交易方式付款？
* 
* 担保交易的交易状态变化顺序是：等待买家付款→买家已付款，等待卖家发货→卖家已发货，等待买家收货→买家已收货，交易完成
* 即时到帐的交易状态变化顺序是：等待买家付款→交易完成
* 
* 每当收到支付宝发来通知时，就可以获取到这笔交易的交易状态，并且商户需要利用商户订单号查询商户网站的订单数据，
* 得到这笔订单在商户网站中的状态是什么，把商户网站中的订单状态与从支付宝通知中获取到的状态来做对比。
* 如果商户网站中目前的状态是等待买家付款，而从支付宝通知获取来的状态是买家已付款，等待卖家发货，那么这笔交易买家是用担保交易方式付款的
* 如果商户网站中目前的状态是等待买家付款，而从支付宝通知获取来的状态是交易完成，那么这笔交易买家是用即时到帐方式付款的
*/
//NOTMODE 不需要载入控制器
const BSPHP_SET = 'NOTMODE';
require_once ('../../../LibBsphp/Global.Bsphp.Inc.php');
require_once (BSPHP_DIR_SYS . 'include/modules/payment/paycood/alipay/notify_url.php');

?>