<?php

return array(
    'admin_login_log' => '后台登录',
    'user_login_log' => '用户登录',
    'yao_registration_log' => '邀请日志',
    'agent_ka_log' => '代理制卡',
    'yao_money_log' => '佣金提成',
    'exit_log' => '执行失败',
    'od_po_log' => '反破解',
    'money_buy_log' => '余额扣除',
    '10001'=>'搜索字段:',
    '10002'=>'用户',
    '10003'=>'IP地址',
    '10004'=>'日志内容',
    '10005'=>'关键字:',
    '10006'=>'排序:',
    '10007'=>'正序',
    '10008'=>'倒序',
    '10009'=>'搜索',
    '10010'=>'选择',
    '10011'=>'编号',
    '10012'=>'记录时间',
    '10013'=>'登录ip',
    '10014'=>'用户名',
    '10015'=>'信息',
    '10016'=>'操作的项目..',
    '10017'=>'清空全部',
    '10018'=>'清理7天前记录',
    '10019'=>'清理50天前记',
    '10020'=>'删除选择记录',
    '10021'=>'提交',
    );

    
    
    
    
    
    

?>